In [1]:
Cars={"company":("toyota","landrover","mahindra","tata"),"cars":("landcruiser","defender","thar","harrier")}
print(Cars)

{'company': ('toyota', 'landrover', 'mahindra', 'tata'), 'cars': ('landcruiser', 'defender', 'thar', 'harrier')}

In [2]:
import pandas
import pandas as pd
df_Cars=pd.DataFrame(Cars)
df_Cars

     company         cars
0     toyota  landcruiser
1  landrover     defender
2   mahindra         thar
3       tata      harrier

In [3]:
df_Cars[1:3]

     company      cars
1  landrover  defender
2   mahindra      thar

In [4]:
df_Cars[:4]

     company         cars
0     toyota  landcruiser
1  landrover     defender
2   mahindra         thar
3       tata      harrier

In [5]:
df_Cars[1:]

     company      cars
1  landrover  defender
2   mahindra      thar
3       tata   harrier

In [6]:
for i in df_Cars:
    print(df_Cars[i])

0       toyota
1    landrover
2     mahindra
3         tata
Name: company, dtype: object
0    landcruiser
1       defender
2           thar
3        harrier
Name: cars, dtype: object

In [7]:
for i in df_Cars.keys():
    print(i)

company
cars

In [8]:
for i in df_Cars.values:
    print(i)

['toyota' 'landcruiser']
['landrover' 'defender']
['mahindra' 'thar']
['tata' 'harrier']

In [9]:
def fun():
    company=("toyota","landrover")
    cars=("fortuner","defender")
    return(company,cars)

(company,cars)=fun()
print(fun())

(('toyota', 'landrover'), ('fortuner', 'defender'))

In [10]:
df_value=df_Cars[(df_Cars.company=="mahindra")]
df_value

    company  cars
2  mahindra  thar

In [11]:
df_rows=df_Cars[(df_Cars.company=="toyota") | (df_Cars.cars=="thar")]
df_rows

    company         cars
0    toyota  landcruiser
2  mahindra         thar

In [12]:
Cars_details={"cars":("landcruiser","defender","thar","harrier","innova"),"colour":("white","green","red","black","white")}
print(Cars_details)

{'cars': ('landcruiser', 'defender', 'thar', 'harrier', 'innova'), 'colour': ('white', 'green', 'red', 'black', 'white')}

In [13]:
df_Cars_details=pd.DataFrame(Cars_details)
df_Cars_details

          cars colour
0  landcruiser  white
1     defender  green
2         thar    red
3      harrier  black
4       innova  white

In [14]:
df_outer=df_Cars.merge(df_Cars_details,on="cars",how="outer")
df_outer

     company         cars colour
0     toyota  landcruiser  white
1  landrover     defender  green
2   mahindra         thar    red
3       tata      harrier  black
4        NaN       innova  white

In [15]:
df_inner=df_Cars.merge(df_Cars_details,on="cars",how="inner")
df_inner

     company         cars colour
0     toyota  landcruiser  white
1  landrover     defender  green
2   mahindra         thar    red
3       tata      harrier  black

In [16]:
df_left=df_Cars.merge(df_Cars_details,on="cars",how="left")
df_left

     company         cars colour
0     toyota  landcruiser  white
1  landrover     defender  green
2   mahindra         thar    red
3       tata      harrier  black

In [17]:
df_right=df_Cars.merge(df_Cars_details,on="cars",how="right")
df_right

     company         cars colour
0     toyota  landcruiser  white
1  landrover     defender  green
2   mahindra         thar    red
3       tata      harrier  black
4        NaN       innova  white

In [18]:
df_Cars.groupby("company").count()

           cars
company
landrover     1
mahindra      1
tata          1
toyota        1

In [19]:
df_Cars.groupby("cars").count()

             company
cars
defender           1
harrier            1
landcruiser        1
thar               1

In [20]:
df_Cars_details.groupby("colour").count()

        cars
colour
black      1
green      1
red        1
white      2

In [21]:
df_Cars_details.groupby("cars").count()

             colour
cars
defender          1
harrier           1
innova            1
landcruiser       1
thar              1

In [29]:
#my_dict = {"hello": "world", "cat": "bat"}

# Iterate over keys and print values for keys that match a condition
for key in df_Cars:
    if key == "company":
        print(f"Key: {key}, Value: {df_Cars[key]}")
    else:
        print("nothing")

Key: company, Value: 0       toyota
1    landrover
2     mahindra
3         tata
Name: company, dtype: object
nothing

In [23]:
for key in df_Cars_details:
    if value == "thar":
        print(f"Key: {df_Cars_details[value]}, Value: {value}")

NameError: name 'value' is not defined

In [ ]:
def carname():
    if "company"=="mahindra" and "cars"=="thar" in df_cars:
        print("Cars")
    return(print)

In [ ]:
carname()

In [ ]:
customers={"customer_id":[1,2,3,4,5],"name":['bhanu','ravi','ramu','raju','ashok'],"age":[33,22,25,22,28],"country":['USA','UK','USA','UAE','UK']}

In [ ]:
orders={"order_id":[1,2,3,4,5],"item":["keyboard","mouse","monitor","mousepad","keyboard"],"amount":[400,300,15000,250,400],"customer_id":[4,4,3,2,1]}